recept/src/Documents/ВыпускПродукцииСтарый/ВыпускПродукцииСтарый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииСтарый</name>
  <basedOn>Document.Рецептуры</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>InformationRegister.ЦеныМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Рецептуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПоУмолчанию</name>
    <type>
      <types>EnumRef.СтатусыГотовностиПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Брак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>НаменованиеПродукции</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристики</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОбеспечения</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вязкость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перетир</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходнойКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/AccumulationRegisters/ЗаказыРезервы/ЗаказыРезервы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыРезервы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристики</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВыпускПродукции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Enums/СтатусыГотовностиПродукции/СтатусыГотовностиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыГотовностиПродукции</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.ЗаказыРезервы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вязкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перетир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Брак</name>
    <type>
      <types>EnumRef.Брак</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

recept/src/Documents/ВыпускПродукцииСтарый/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// 1. ИНИЦИАЛИЗАЦИЯ И ОЧИСТКА ДВИЖЕНИЙ
	Движения.ЗаказыРезервы.Записывать = Истина;
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.Записать();
	
	// 2. ПОДГОТОВКА ЗАПРОСА (Работаем напрямую с измерением регистра)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ГраницаКонтроля", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧПродукция.НаменованиеПродукции КАК Номенклатура,
		|	ТЧПродукция.Характеристики КАК Характеристика,
		|	ТЧПродукция.Ссылка КАК Партия,
		|	СУММА(ТЧПродукция.Количество) КАК КоличествоВыпуска
		|ПОМЕСТИТЬ ВТ_Выпуск
		|ИЗ
		|	Документ.ВыпускПродукции.Продукция КАК ТЧПродукция
		|ГДЕ
		|	ТЧПродукция.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ТЧПродукция.Номенклатура,
		|	ТЧПродукция.Характеристика,
		|	ТЧПродукция.Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выпуск.Номенклатура КАК Номенклатура,
		|	ВТ_Выпуск.Характеристика КАК Характеристика,
		|	ВТ_Выпуск.Партия КАК Партия,
		|	ВТ_Выпуск.КоличествоВыпуска КАК КоличествоВыпуска,
		|	ЕСТЬNULL(РезервыОстатки.ЗаказПокупателя, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗаказПокупателя,
		|	ЕСТЬNULL(РезервыОстатки.ДатаОтгрузки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаГотовности,
		|	ЕСТЬNULL(РезервыОстатки.КоличествоОстаток, 0) КАК КоличествоПотребность
		|ИЗ
		|	ВТ_Выпуск КАК ВТ_Выпуск
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыРезервы.Остатки(
		|				&ГраницаКонтроля,
		|				(Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ ВТ.Номенклатура, ВТ.Характеристика ИЗ ВТ_Выпуск КАК ВТ)
		|			) КАК РезервыОстатки
		|		ПО ВТ_Выпуск.Номенклатура = РезервыОстатки.Номенклатура
		|			И ВТ_Выпуск.Характеристика = РезервыОстатки.Характеристика
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ДатаГотовности ВОЗР"; 
		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекущаяНоменклатура   = Неопределено;
	ТекущаяХарактеристика = Неопределено;
	ТекущаяПартия         = Неопределено;
	ОсталосьРаспределить  = 0;
	
	// 3. РАСПРЕДЕЛЕНИЕ ВЫПУСКА
	Пока Выборка.Следующий() Цикл
		
		Если ТекущаяНоменклатура <> Выборка.Номенклатура 
			Или ТекущаяХарактеристика <> Выборка.Характеристика 
			Или ТекущаяПартия <> Выборка.Партия Тогда
			
			// Списываем излишек предыдущей номенклатуры на свободный склад (Счет пустой)
			Если ОсталосьРаспределить > 0 Тогда
				ДвижениеСвободный = Движения.ОстаткиМатериалов.Добавить();
				ДвижениеСвободный.ВидДвижения   = ВидДвиженияНакопления.Приход;
				ДвижениеСвободный.Период        = Дата;
				ДвижениеСвободный.Наименование  = ТекущаяНоменклатура;
				ДвижениеСвободный.Характеристики = ТекущаяХарактеристика;
				ДвижениеСвободный.Партия        = ТекущаяПартия;
				ДвижениеСвободный.Счет          = Документы.ЗаказПокупателя.ПустаяСсылка();
				ДвижениеСвободный.Остаток       = ОсталосьРаспределить;
			КонецЕсли;
			
			ТекущаяНоменклатура   = Выборка.Номенклатура;
			ТекущаяХарактеристика = Выборка.Характеристика;
			ТекущаяПартия         = Выборка.Партия;
			ОсталосьРаспределить  = Выборка.КоличествоВыпуска;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ЗаказПокупателя) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОсталосьРаспределить = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РаспределеноНаЗаказ = Мин(ОсталосьРаспределить, Выборка.КоличествоПотребность);
		
		Если РаспределеноНаЗаказ > 0 Тогда
			
			// Расход из резервов
			ДвижениеРезерв = Движения.ЗаказыРезервы.Добавить();
			ДвижениеРезерв.ВидДвижения     = ВидДвиженияНакопления.Расход;
			ДвижениеРезерв.Период          = Дата;
			ДвижениеРезерв.Номенклатура    = Выборка.Номенклатура;
			ДвижениеРезерв.Характеристика = Выборка.Характеристика;
			ДвижениеРезерв.ЗаказПокупателя = Выборка.ЗаказПокупателя;
			ДвижениеРезерв.ДатаОтгрузки    = Выборка.ДатаГотовности; // Заполняем измерение при расходе
			ДвижениеРезерв.Количество      = РаспределеноНаЗаказ;
			
			// Приход в остатки материалов (под конкретный заказ)
			ДвижениеОстатки = Движения.ОстаткиМатериалов.Добавить();
			ДвижениеОстатки.ВидДвижения   = ВидДвиженияНакопления.Приход;
			ДвижениеОстатки.Период        = Дата;
			ДвижениеОстатки.Наименование  = Выборка.Номенклатура;
			ДвижениеОстатки.Характеристики = Выборка.Характеристика;
			ДвижениеОстатки.Партия        = Выборка.Партия;
			ДвижениеОстатки.Счет          = Выборка.ЗаказПокупателя; 
			ДвижениеОстатки.Остаток       = РаспределеноНаЗаказ;
			
			ОсталосьРаспределить = ОсталосьРаспределить - РаспределеноНаЗаказ;
		КонецЕсли;
		
	КонецЦикла;
	
	// 4. ОБРАБОТКА ИЗЛИШКА ПОСЛЕДНЕЙ ПОЗИЦИИ
	Если ОсталосьРаспределить > 0 Тогда
		ДвижениеСвободный = Движения.ОстаткиМатериалов.Добавить();
		ДвижениеСвободный.ВидДвижения   = ВидДвиженияНакопления.Приход;
		ДвижениеСвободный.Период        = Дата;
		ДвижениеСвободный.Наименование  = ТекущаяНоменклатура;
		ДвижениеСвободный.Характеристики = ТекущаяХарактеристика;
		ДвижениеСвободный.Партия        = ТекущаяПартия;
		ДвижениеСвободный.Счет          = Документы.ЗаказПокупателя.ПустаяСсылка();
		ДвижениеСвободный.Остаток       = ОсталосьРаспределить;
	КонецЕсли;
    
    
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецептуры") Тогда
		НомерДокументаОснования = ДанныеЗаполнения.Наименование;
		Примечание = ДанныеЗаполнения.Примечание;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Номер = ДанныеЗаполнения.Номер;
		Для Каждого ТекСтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл  
			Если ТекСтрокаПродукция.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ВРаботе Тогда
				НоваяСтрока = Продукция.Добавить();
				НоваяСтрока.Количество = ТекСтрокаПродукция.Количество;
				НоваяСтрока.НаменованиеПродукции = ТекСтрокаПродукция.Наименование;
				НоваяСтрока.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ГотовКОтгрузке;
				НоваяСтрока.Цена = ТекСтрокаПродукция.Цена;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
